In [2]:
import pandas as pd
import pickle
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [3]:

cabData = pd.read_csv('../DataSets/Cab_Data.csv')
cityData = pd.read_csv('../DataSets/City.csv')
customerData = pd.read_csv('../DataSets/Customer_ID.csv')
transactionData = pd.read_csv('../DataSets/Transaction_ID.csv')

In [4]:
cabData

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.6350
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.8540
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.6320
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.6020
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.7760
...,...,...,...,...,...,...,...
359387,10440101,43108,Yellow Cab,WASHINGTON DC,4.80,69.24,63.3600
359388,10440104,43104,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480
359389,10440105,43105,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500
359390,10440106,43105,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480
359391,10440107,43102,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192

In [28]:
cabData['Transaction ID'].drop_duplicates()

0         10000011
1         10000012
2         10000013
3         10000014
4         10000015
            ...
359387    10440101
359388    10440104
359389    10440105
359390    10440106
359391    10440107
Name: Transaction ID, Length: 359392, dtype: int64

In [5]:
cityData

                City   Population      Users
0        NEW YORK NY   8,405,837    302,149
1         CHICAGO IL   1,955,130    164,468
2     LOS ANGELES CA   1,595,037    144,132
3           MIAMI FL   1,339,155     17,675
4     SILICON VALLEY   1,177,609     27,247
5      ORANGE COUNTY   1,030,185     12,994
6       SAN DIEGO CA     959,307     69,995
7         PHOENIX AZ     943,999      6,133
8          DALLAS TX     942,908     22,157
9         ATLANTA GA     814,885     24,701
10         DENVER CO     754,233     12,421
11         AUSTIN TX     698,371     14,978
12        SEATTLE WA     671,238     25,063
13         TUCSON AZ     631,442      5,712
14  SAN FRANCISCO CA     629,591    213,609
15     SACRAMENTO CA     545,776      7,044
16     PITTSBURGH PA     542,085      3,643
17     WASHINGTON DC     418,859    127,001
18      NASHVILLE TN     327,225      9,270
19         BOSTON MA     248,968     80,021

In [6]:
customerData

       Customer ID  Gender  Age  Income (USD/Month)
0            29290    Male   28               10813
1            27703    Male   27                9237
2            28712    Male   53               11242
3            28020    Male   23               23327
4            27182    Male   33                8536
...            ...     ...  ...                 ...
49166        12490    Male   33               18713
49167        14971    Male   30               15346
49168        41414    Male   38                3960
49169        41677    Male   23               19454
49170        39761  Female   32               10128

[49171 rows x 4 columns]

In [27]:
customerData['Customer ID'].drop_duplicates()

0        29290
1        27703
2        28712
3        28020
4        27182
         ...
49166    12490
49167    14971
49168    41414
49169    41677
49170    39761
Name: Customer ID, Length: 49171, dtype: int64

In [8]:
transactionData

        Transaction ID  Customer ID Payment_Mode
0             10000011        29290         Card
1             10000012        27703         Card
2             10000013        28712         Cash
3             10000014        28020         Cash
4             10000015        27182         Card
...                ...          ...          ...
440093        10440104        53286         Cash
440094        10440105        52265         Cash
440095        10440106        52175         Card
440096        10440107        52917         Card
440097        10440108        51587         Card

[440098 rows x 3 columns]

In [26]:
transactionData['Transaction ID'].drop_duplicates()

0         10000011
1         10000012
2         10000013
3         10000014
4         10000015
            ...
440093    10440104
440094    10440105
440095    10440106
440096    10440107
440097    10440108
Name: Transaction ID, Length: 440098, dtype: int64

In [37]:
cab_transactionData = cabData.merge(right=transactionData, how='outer', on='Transaction ID').sort_values(by='Transaction ID')

In [38]:
cab_transactionData

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Customer ID,Payment_Mode
0,10000011,42377.0,Pink Cab,ATLANTA GA,30.45,370.95,313.6350,29290,Card
1,10000012,42375.0,Pink Cab,ATLANTA GA,28.62,358.52,334.8540,27703,Card
2,10000013,42371.0,Pink Cab,ATLANTA GA,9.04,125.20,97.6320,28712,Cash
3,10000014,42376.0,Pink Cab,ATLANTA GA,33.17,377.40,351.6020,28020,Cash
4,10000015,42372.0,Pink Cab,ATLANTA GA,8.73,114.62,97.7760,27182,Card
...,...,...,...,...,...,...,...,...,...
359388,10440104,43104.0,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480,53286,Cash
359389,10440105,43105.0,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500,52265,Cash
359390,10440106,43105.0,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480,52175,Card
359391,10440107,43102.0,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192,52917,Card
440097,10440108,NaN,NaN,NaN,NaN,NaN,NaN,51587,Card

In [39]:
cab_trans_city = cab_transactionData.merge(right=cityData, how="left", on='City')

In [40]:
cab_trans_city

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Customer ID,Payment_Mode,Population,Users
0,10000011,42377.0,Pink Cab,ATLANTA GA,30.45,370.95,313.6350,29290,Card,"814,885","24,701"
1,10000012,42375.0,Pink Cab,ATLANTA GA,28.62,358.52,334.8540,27703,Card,"814,885","24,701"
2,10000013,42371.0,Pink Cab,ATLANTA GA,9.04,125.20,97.6320,28712,Cash,"814,885","24,701"
3,10000014,42376.0,Pink Cab,ATLANTA GA,33.17,377.40,351.6020,28020,Cash,"814,885","24,701"
4,10000015,42372.0,Pink Cab,ATLANTA GA,8.73,114.62,97.7760,27182,Card,"814,885","24,701"
...,...,...,...,...,...,...,...,...,...,...,...
440093,10440104,43104.0,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480,53286,Cash,"418,859","127,001"
440094,10440105,43105.0,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500,52265,Cash,"418,859","127,001"
440095,10440106,43105.0,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480,52175,Card,"418,859","127,001"
440096,10440107,43102.0,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192,52917,Card,"418,859","127,001"
440097,10440108,NaN,NaN,NaN,NaN,NaN,NaN,51587,Card,NaN,NaN

In [41]:
dataFinal = cab_trans_city.merge(right=customerData, how='left', on='Customer ID')

In [42]:
dataFinal

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Customer ID,Payment_Mode,Population,Users,Gender,Age,Income (USD/Month)
0,10000011,42377.0,Pink Cab,ATLANTA GA,30.45,370.95,313.6350,29290,Card,"814,885","24,701",Male,28,10813
1,10000012,42375.0,Pink Cab,ATLANTA GA,28.62,358.52,334.8540,27703,Card,"814,885","24,701",Male,27,9237
2,10000013,42371.0,Pink Cab,ATLANTA GA,9.04,125.20,97.6320,28712,Cash,"814,885","24,701",Male,53,11242
3,10000014,42376.0,Pink Cab,ATLANTA GA,33.17,377.40,351.6020,28020,Cash,"814,885","24,701",Male,23,23327
4,10000015,42372.0,Pink Cab,ATLANTA GA,8.73,114.62,97.7760,27182,Card,"814,885","24,701",Male,33,8536
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
440093,10440104,43104.0,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480,53286,Cash,"418,859","127,001",Male,32,6528
440094,10440105,43105.0,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500,52265,Cash,"418,859","127,001",Male,56,7966
440095,10440106,43105.0,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480,52175,Card,"418,859","127,001",Male,32,6423
440096,10440107,43102.0,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192,52917,Card,"418,859","127,001",Male,20,11284
440097,10440108,NaN,NaN,NaN,NaN,NaN,NaN,51587,Card,NaN,NaN,Male,39,23470

In [15]:
dataFinal['Income (USD/Month)'].mean()

15048.822937071498

In [16]:

dataFinal[['KM Travelled', 'Price Charged', 'Cost of Trip', 'Age', 'Income (USD/Month)']].describe()

,KM Travelled,Price Charged,Cost of Trip,Age,Income (USD/Month)
count,359392.000000,359392.000000,359392.000000,359392.000000,359392.000000
mean,22.567254,423.443311,286.190113,35.336705,15048.822937
std,12.233526,274.378911,157.993661,12.594234,7969.409482
min,1.900000,15.600000,19.000000,18.000000,2000.000000
25%,12.000000,206.437500,151.200000,25.000000,8424.000000
50%,22.440000,386.360000,282.480000,33.000000,14685.000000
75%,32.960000,583.660000,413.683200,42.000000,21035.000000
max,48.000000,2048.030000,691.200000,65.000000,35000.000000

In [23]:
pinkFinal = dataFinal.loc[dataFinal['Company'] == "Pink Cab"]

In [21]:
yellowFinal = dataFinal.loc[dataFinal['Company'] == "Yellow Cab"]

In [24]:
pinkFinal[['KM Travelled', 'Price Charged', 'Cost of Trip', 'Age', 'Income (USD/Month)']].describe()

,KM Travelled,Price Charged,Cost of Trip,Age,Income (USD/Month)
count,84711.000000,84711.000000,84711.000000,84711.000000,84711.000000
mean,22.559917,310.800856,248.148682,35.322414,15059.047137
std,12.231092,181.995661,135.403345,12.644780,7991.077762
min,1.900000,15.600000,19.000000,18.000000,2000.000000
25%,12.000000,159.970000,131.868000,25.000000,8371.000000
50%,22.440000,298.060000,246.330000,33.000000,14713.000000
75%,32.960000,441.505000,360.180000,42.000000,21055.000000
max,48.000000,1623.480000,576.000000,65.000000,35000.000000

In [25]:
yellowFinal[['KM Travelled', 'Price Charged', 'Cost of Trip', 'Age', 'Income (USD/Month)']].describe()

,KM Travelled,Price Charged,Cost of Trip,Age,Income (USD/Month)
count,274681.000000,274681.000000,274681.000000,274681.000000,274681.000000
mean,22.569517,458.181990,297.922004,35.341112,15045.669817
std,12.234298,288.386166,162.548986,12.578625,7962.727062
min,1.900000,20.730000,22.800000,18.000000,2000.000000
25%,11.990000,226.680000,158.400000,25.000000,8439.000000
50%,22.440000,425.060000,295.596000,33.000000,14676.000000
75%,32.960000,633.880000,432.432000,42.000000,21023.000000
max,48.000000,2048.030000,691.200000,65.000000,34996.000000